# Format Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UnitFormatUtils..::..Format Method
UnitFormatUtils Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Format(Units, ForgeTypeId, Double, Boolean) | Formats a number with units into a string. |
| Format(Units, ForgeTypeId, Double, Boolean, FormatValueOptions) | Formats a number with units into a string. |

# See Also
UnitFormatUtils Class
UnitFormatUtils Members
Autodesk.Revit.DB Namespace